app/views/events/_show.html.erb

  <%
    @comments = Comment.where(event_id: event)
---
SELECT "comments".* FROM "comments"  WHERE "comments"."event_id" IS NULL