app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "created_at", "details", "event_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Sam the man"], ["created_at", "2014-10-23 20:30:03.863327"], ["details", "Yoooooo! First comment mate."], ["event_id", 1], ["updated_at", "2014-10-23 20:30:03.863327"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "details" = ?, "updated_at" = ? WHERE "comments"."id" = 3
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)