app/controllers/events_controller.rb

SELECT "events".* FROM "events"  WHERE (events.id = 1)
---
  def index
    @events = Event.all

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"  WHERE (event_id = 1)
---
  def show
    @event = Event.find(params[:event_id])
    @comments = Comment.where(event_id: params[:event_id])

INSERT INTO "events" ("created_at", "date", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = 1
---
  def update
    respond_to do |format|
      if @event.update(event_params)